{
  "intents": [
    {
      "tag": "electrical",
      "patterns": [
        "ما هو الفرق بين الجهد والتيار الكهربائي؟",
        "كيف يمكنني اختيار قاطع الدائرة المناسب؟",
        "ما هو دور الأرضي في الدوائر الكهربائية؟"
      ],
      "responses": [
        "الجهد يقاس بالفولت وهو فارق الكهرباء بين نقطتين. التيار يقاس بالأمبير وهو تدفق الكهرباء في الدائرة.",
        "اختيار قاطع الدائرة يعتمد على تقدير الحمل الكهربائي والتيار المناسب للدائرة.",
        "الأرضي يساعد في توجيه الكهرباء الزائدة إلى الأرض لمنع التيار الزائد وحماية الأفراد والأجهزة."
      ]
    },
    {
      "tag": "plumbing",
      "patterns": [
        "ما هو أفضل نوع من الأنابيب للسباكة؟",
        "كيف يمكنني إصلاح تسرب في الأنابيب النحاسية؟",
        "كيف أقوم بتجنب تجمد الأنابيب في فصل الشتاء؟"
      ],
      "responses": [
        "البلاستيك والنحاس من أنواع الأنابيب المستخدمة بشكل شائع. اختيار النوع يعتمد على الاحتياجات والبيئة.",
        "قم بتنظيف المنطقة المتضررة واستخدم شريط الإصلاح الخاص بالأنابيب النحاسية.",
        "قم بعزل الأنابيب في المناطق الباردة باستخدام عازل حراري واترك صنبورًا ينقط بانتظام لتجنب التجمد."
      ]
    },
    {
      "tag": "carpentry",
      "patterns": [
        "ما هي أهم الأدوات المطلوبة لبناء مشروع خشبي؟",
        "كيف يمكنني عمل مفصلات خشبية متينة؟",
        "ما هي أفضل طريقة لتلميع الأثاث الخشبي؟"
      ],
      "responses": [
        "الأدوات المهمة تشمل المنشار الدائري، المسطرة، المثقاب، ومجموعة متنوعة من الأدوات اليدوية.",
        "استخدم مفصلات عالية الجودة واتبع تعليمات الإرفاق بدقة لضمان متانة المفصلات الخشبية.",
        "استخدم ورق الصنفرة الناعم لتلميع الأثاث الخشبي ويمكنك استخدام طبقة رقيقة من الورنيش لحماية السطح."
      ]
    },
    {
      "tag": "electrical",
      "patterns": [
        "ما هي متطلبات السلامة الأساسية عند التعامل مع الكهرباء؟",
        "كيف يمكنني اختبار سلك كهربائي للتأكد من سلامته؟",
        "ما هو الفرق بين التيار المستمر والتيار المتردد؟"
      ],
      "responses": [
        "ارتد معدات السلامة مثل القفازات والنظارات عند التعامل مع الكهرباء. قم بفصل الطاقة قبل البدء.",
        "استخدم جهاز اختبار الجهد لاختبار سلك الكهرباء. تأكد من قطع التيار قبل الاختبار.",
        "التيار المستمر يتدفق في اتجاه واحد، بينما التيار المتردد يتغير اتجاهه بانتظام. التيار المتردد هو النوع الأكثر شيوعًا في المنازل."
      ]
    },
    {
      "tag": "plumbing",
      "patterns": [
        "ما هي أسباب تسرب المياه في الحمام؟",
        "كيف يمكنني تركيب مرحاض جديد بنفسي؟",
        "ما هي أفضل طريقة لتسريب أنبوب المياه؟"
      ],
      "responses": [
        "تسرب المياه في الحمام قد يكون نتيجة لخراب الأختام أو التصاق الجير. يجب إصلاحه فورًا.",
        "تركيب المرحاض الجديد يتطلب توصيل الخرطوم بخط المياه وتثبيته بشكل آمن في مكانه.",
        "استخدم شريط الفولاذ لتسريب أنبوب المياه. ضعه حول الانبوب وأغلقه بإحكام."
      ]
    },
    {
      "tag": "carpentry",
      "patterns": [
        "ما هي أنواع الخشب المناسبة لصنع الأثاث؟",
        "كيف يمكنني تثبيت قطع الخشب معًا بشكل محكم؟",
        "كيف يمكنني تلميع السطح الخشبي بمظهر طبيعي؟"
      ],
      "responses": [
        "أنواع الخشب المناسبة تشمل البلوط والقيقب والصنوبر. اختيار النوع يعتمد على التصميم والاستخدام.",
        "استخدم مسامير وغراء قوي لتثبيت قطع الخشب معًا. يمكن استخدام المشابك لتثبيتها حتى يجف الغراء.",
        "استخدم ورق الصنفرة والورنيش الشفاف لتلميع السطح وإبراز جمال الخشب."
      ]
    },
    {
      "tag": "electrical",
      "patterns": [
        "ما هو دور مكثف البدء في محرك الغسالة؟",
        "كيف يمكنني إصلاح مأخذ كهربائي لا يعمل؟",
        "هل يمكنني تركيب أسلاك كهربائية خارجية؟"
      ],
      "responses": [
        "مكثف البدء يساعد في بدء تشغيل محرك الغسالة وتوفير الزخم اللازم لبدء الدوران.",
        "افحص الدائرة الكهربائية وتأكد من وجود توصيل سليم. قد تحتاج إلى استدعاء فني كهربائي إذا لم تستطيع إصلاحه بنفسك.",
        "يجب تركيب الأسلاك الكهربائية داخل الجدران وبشكل آمن. تركيب الأسلاك الخارجية قد يكون خطرًا."
      ]
    },
    {
      "tag": "plumbing",
      "patterns": [
        "ما هي طرق إصلاح تسرب في الأنابيب البلاستيكية؟",
        "كيف يمكنني تركيب حنفية المطبخ؟",
        "كيف يمكنني تنظيف المصرف الصحي الخاص بالحمام؟"
      ],
      "responses": [
        "استخدم شريط إصلاح الأنابيب البلاستيكية لسد التسرب. يمكنك أيضًا استبدال جزء من الأنبوب المتضرر.",
        "اتبع تعليمات الشركة المصنعة لتركيب حنفية المطبخ. قد تحتاج إلى أدوات أساسية مثل مفك ومشابك.",
        "استخدم أسطوانة أسلاك لإزالة الشعر والشوائب من المصرف الصحي. قم بتنظيفه بالماء الساخن بانتظام."
      ]
    },
    {
      "tag": "carpentry",
      "patterns": [
        "ما هي الأخشاب المناسبة لصنع الأثاث الخارجي؟",
        "كيف يمكنني عمل تصميم معقد باستخدام الخشب؟",
        "ما هي أفضل طريقة لإصلاح تشققات الخشب؟"
      ],
      "responses": [
        "الأخشاب المقاومة للعوامل الجوية مثل السديم والأوكالبتوس مناسبة للأثاث الخارجي.",
        "قم برسم التصميم بدقة قبل البدء واستخدم مجموعة متنوعة من الأدوات لتحقيق التفاصيل.",
        "استخدم الغراء الخشبي لملء التشققات واتركه يجف. ثم قم بتلميع المنطقة لتجانب الانبساط."
      ]
    }
  ]
}
